---
kind: property
id: P:Autodesk.Revit.DB.LayoutRuleClearSpacing.Spacing
source: html/67e7bcbb-1384-3e2b-fcb4-186ee3b1adea.htm
---
# Autodesk.Revit.DB.LayoutRuleClearSpacing.Spacing Property

Get or set the spacing of the beam system.

## Syntax (C#)
```csharp
public double Spacing { get; set; }
```

## Remarks
The value of spacing must be in [0, 30000), but in fact the spacing
should not be too small or too great.